# ContinuousFootingEccentricity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ContinuousFootingEccentricity Property
ParameterTypeId Class See Also
---
"Eccentricity"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ContinuousFootingEccentricity { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContinuousFootingEccentricity As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ContinuousFootingEccentricity {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace